-- phpMyAdmin SQL Dump
-- version 5.2.1
-- https://www.phpmyadmin.net/
--
-- Host: 127.0.0.1
-- 생성 시간: 23-06-08 12:27
-- 서버 버전: 10.4.28-MariaDB
-- PHP 버전: 8.2.4

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- 데이터베이스: `jooboo`
--
CREATE DATABASE IF NOT EXISTS `jooboo` DEFAULT CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci;
USE `jooboo`;

-- --------------------------------------------------------

--
-- 테이블 구조 `ingredient`
--

DROP TABLE IF EXISTS `ingredient`;
CREATE TABLE `ingredient` (
  `recipe_No` int(5) NOT NULL,
  `main_ing` varchar(1000) NOT NULL,
  `sub_ing` varchar(1000) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- 테이블의 덤프 데이터 `ingredient`
--

INSERT INTO `ingredient` (`recipe_No`, `main_ing`, `sub_ing`) VALUES
(1, 'a:10:{i:0;a:2:{i:0;s:9:\"쌀뜨물\";i:1;s:5:\"700ml\";}i:1;a:2:{i:0;s:6:\"대파\";i:1;s:6:\"1/2개\";}i:2;a:2:{i:0;s:12:\"청양고추\";i:1;s:4:\"1개\";}i:3;a:2:{i:0;s:31:\"돼지고기 목살or 삼겹살\";i:1;s:4:\"600g\";}i:4;a:2:{i:0;s:6:\"김치\";i:1;s:4:\"3줌\";}i:5;a:2:{i:0;N;i:1;N;}i:6;a:2:{i:0;N;i:1;N;}i:7;a:2:{i:0;N;i:1;N;}i:8;a:2:{i:0;N;i:1;N;}i:9;a:2:{i:0;N;i:1;N;}}', 'a:10:{i:0;a:2:{i:0;s:6:\"된장\";i:1;s:4:\"1/2T\";}i:1;a:2:{i:0;s:9:\"새우젓\";i:1;s:4:\"1/2T\";}i:2;a:2:{i:0;s:13:\"다진 마늘\";i:1;s:4:\"1/2T\";}i:3;a:2:{i:0;s:12:\"고춧가루\";i:1;s:4:\"1/2T\";}i:4;a:2:{i:0;s:9:\"국간장\";i:1;s:2:\"1T\";}i:5;a:2:{i:0;N;i:1;N;}i:6;a:2:{i:0;N;i:1;N;}i:7;a:2:{i:0;N;i:1;N;}i:8;a:2:{i:0;N;i:1;N;}i:9;a:2:{i:0;N;i:1;N;}}'),
(2, 'a:10:{i:0;a:2:{i:0;s:19:\"베이킹 파우더\";i:1;s:2:\"1t\";}i:1;a:2:{i:0;s:6:\"버터\";i:1;s:4:\"100g\";}i:2;a:2:{i:0;s:19:\"동물성 생크림\";i:1;s:4:\"80ml\";}i:3;a:2:{i:0;s:6:\"달걀\";i:1;s:4:\"6개\";}i:4;a:2:{i:0;s:22:\"가루형 알룰로스\";i:1;s:2:\"5T\";}i:5;a:2:{i:0;s:26:\"히말랴야 핑크 소금\";i:1;s:4:\"1/2t\";}i:6;a:2:{i:0;s:22:\"바닐라 익스트랙\";i:1;s:2:\"1t\";}i:7;a:2:{i:0;s:0:\"\";i:1;s:0:\"\";}i:8;a:2:{i:0;s:0:\"\";i:1;s:0:\"\";}i:9;a:2:{i:0;s:0:\"\";i:1;s:0:\"\";}}', 'a:10:{i:0;a:2:{i:0;s:26:\"아몬드/코코아 가루\";i:1;s:4:\"150g\";}i:1;a:2:{i:0;s:22:\"에로루트 파우더\";i:1;s:2:\"1T\";}i:2;a:2:{i:0;s:12:\"알룰로스\";i:1;s:3:\"55g\";}i:3;a:2:{i:0;s:16:\"카카오 매스\";i:1;s:4:\"110g\";}i:4;a:2:{i:0;N;i:1;N;}i:5;a:2:{i:0;N;i:1;N;}i:6;a:2:{i:0;N;i:1;N;}i:7;a:2:{i:0;N;i:1;N;}i:8;a:2:{i:0;N;i:1;N;}i:9;a:2:{i:0;N;i:1;N;}}'),
(3, 'a:10:{i:0;a:2:{i:0;s:9:\"공심채\";i:1;s:4:\"400g\";}i:1;a:2:{i:0;N;i:1;N;}i:2;a:2:{i:0;N;i:1;N;}i:3;a:2:{i:0;N;i:1;N;}i:4;a:2:{i:0;N;i:1;N;}i:5;a:2:{i:0;N;i:1;N;}i:6;a:2:{i:0;N;i:1;N;}i:7;a:2:{i:0;N;i:1;N;}i:8;a:2:{i:0;N;i:1;N;}i:9;a:2:{i:0;N;i:1;N;}}', 'a:10:{i:0;a:2:{i:0;s:6:\"설탕\";i:1;s:2:\"2t\";}i:1;a:2:{i:0;s:25:\"크러쉬드레드 페퍼\";i:1;s:2:\"2T\";}i:2;a:2:{i:0;s:6:\"통깨\";i:1;s:2:\"1t\";}i:3;a:2:{i:0;s:12:\"올리브유\";i:1;s:2:\"4T\";}i:4;a:2:{i:0;s:6:\"액젓\";i:1;s:2:\"2t\";}i:5;a:2:{i:0;s:9:\"굴소스\";i:1;s:2:\"2t\";}i:6;a:2:{i:0;N;i:1;N;}i:7;a:2:{i:0;N;i:1;N;}i:8;a:2:{i:0;N;i:1;N;}i:9;a:2:{i:0;N;i:1;N;}}'),
(4, 'a:10:{i:0;a:2:{i:0;s:15:\"갈은소고기\";i:1;s:4:\"200g\";}i:1;a:2:{i:0;s:6:\"양파\";i:1;s:6:\"1/2개\";}i:2;a:2:{i:0;s:6:\"대파\";i:1;s:4:\"1개\";}i:3;a:2:{i:0;s:15:\"새송이버섯\";i:1;s:4:\"3개\";}i:4;a:2:{i:0;N;i:1;N;}i:5;a:2:{i:0;N;i:1;N;}i:6;a:2:{i:0;N;i:1;N;}i:7;a:2:{i:0;N;i:1;N;}i:8;a:2:{i:0;N;i:1;N;}i:9;a:2:{i:0;N;i:1;N;}}', 'a:10:{i:0;a:2:{i:0;s:9:\"생강즙\";i:1;s:10:\"1작은술\";}i:1;a:2:{i:0;s:9:\"참기름\";i:1;s:10:\"1작은술\";}i:2;a:2:{i:0;s:12:\"후추가루\";i:1;s:10:\"1작은술\";}i:3;a:2:{i:0;s:9:\"매실철\";i:1;s:7:\"1큰술\";}i:4;a:2:{i:0;s:3:\"꿀\";i:1;s:7:\"1큰술\";}i:5;a:2:{i:0;s:12:\"다진마늘\";i:1;s:7:\"1큰술\";}i:6;a:2:{i:0;s:19:\"청주또는 미림\";i:1;s:7:\"1큰술\";}i:7;a:2:{i:0;s:6:\"간장\";i:1;s:7:\"1큰술\";}i:8;a:2:{i:0;N;i:1;N;}i:9;a:2:{i:0;N;i:1;N;}}'),
(5, 'a:10:{i:0;a:2:{i:0;s:9:\"엿기름\";i:1;s:4:\"3컵\";}i:1;a:2:{i:0;s:3:\"물\";i:1;s:2:\"3L\";}i:2;a:2:{i:0;s:6:\"멥쌀\";i:1;s:4:\"2컵\";}i:3;a:2:{i:0;s:6:\"설탕\";i:1;s:6:\"1.5컵\";}i:4;a:2:{i:0;N;i:1;N;}i:5;a:2:{i:0;N;i:1;N;}i:6;a:2:{i:0;N;i:1;N;}i:7;a:2:{i:0;N;i:1;N;}i:8;a:2:{i:0;N;i:1;N;}i:9;a:2:{i:0;N;i:1;N;}}', 'a:10:{i:0;a:2:{i:0;s:3:\"잣\";i:1;s:6:\"약간\";}i:1;a:2:{i:0;s:6:\"대추\";i:1;s:6:\"약간\";}i:2;a:2:{i:0;N;i:1;N;}i:3;a:2:{i:0;N;i:1;N;}i:4;a:2:{i:0;N;i:1;N;}i:5;a:2:{i:0;N;i:1;N;}i:6;a:2:{i:0;N;i:1;N;}i:7;a:2:{i:0;N;i:1;N;}i:8;a:2:{i:0;N;i:1;N;}i:9;a:2:{i:0;N;i:1;N;}}'),
(6, 'a:10:{i:0;a:2:{i:0;s:12:\"파스타면\";i:1;s:7:\"3인분\";}i:1;a:2:{i:0;s:6:\"마늘\";i:1;s:4:\"6알\";}i:2;a:2:{i:0;s:6:\"대파\";i:1;s:7:\"5이ㅠ\";}i:3;a:2:{i:0;s:6:\"고추\";i:1;s:4:\"5개\";}i:4;a:2:{i:0;s:9:\"성게알\";i:1;s:4:\"150g\";}i:5;a:2:{i:0;s:12:\"무염버터\";i:1;s:3:\"30g\";}i:6;a:2:{i:0;s:6:\"액젓\";i:1;s:4:\"2줄\";}i:7;a:2:{i:0;s:12:\"올리브유\";i:1;s:2:\"2T\";}i:8;a:2:{i:0;s:9:\"통후추\";i:1;s:6:\"조금\";}i:9;a:2:{i:0;N;i:1;N;}}', 'a:10:{i:0;a:2:{i:0;s:6:\"소금\";i:1;s:2:\"1T\";}i:1;a:2:{i:0;N;i:1;N;}i:2;a:2:{i:0;N;i:1;N;}i:3;a:2:{i:0;N;i:1;N;}i:4;a:2:{i:0;N;i:1;N;}i:5;a:2:{i:0;N;i:1;N;}i:6;a:2:{i:0;N;i:1;N;}i:7;a:2:{i:0;N;i:1;N;}i:8;a:2:{i:0;N;i:1;N;}i:9;a:2:{i:0;N;i:1;N;}}'),
(7, 'a:10:{i:0;a:2:{i:0;s:27:\"오디즙이나복분자즙\";i:1;s:5:\"200ml\";}i:1;a:2:{i:0;s:6:\"참외\";i:1;s:4:\"1개\";}i:2;a:2:{i:0;N;i:1;N;}i:3;a:2:{i:0;N;i:1;N;}i:4;a:2:{i:0;N;i:1;N;}i:5;a:2:{i:0;N;i:1;N;}i:6;a:2:{i:0;N;i:1;N;}i:7;a:2:{i:0;N;i:1;N;}i:8;a:2:{i:0;N;i:1;N;}i:9;a:2:{i:0;N;i:1;N;}}', 'a:10:{i:0;a:2:{i:0;s:6:\"오이\";i:1;s:4:\"1개\";}i:1;a:2:{i:0;N;i:1;N;}i:2;a:2:{i:0;N;i:1;N;}i:3;a:2:{i:0;N;i:1;N;}i:4;a:2:{i:0;N;i:1;N;}i:5;a:2:{i:0;N;i:1;N;}i:6;a:2:{i:0;N;i:1;N;}i:7;a:2:{i:0;N;i:1;N;}i:8;a:2:{i:0;N;i:1;N;}i:9;a:2:{i:0;N;i:1;N;}}'),
(8, 'a:10:{i:0;a:2:{i:0;s:12:\"무염버터\";i:1;s:3:\"50g\";}i:1;a:2:{i:0;s:12:\"크림치즈\";i:1;s:4:\"100g\";}i:2;a:2:{i:0;s:6:\"설탕\";i:1;s:3:\"80g\";}i:3;a:2:{i:0;s:9:\"달걀(L)\";i:1;s:4:\"2개\";}i:4;a:2:{i:0;s:22:\"바닐라익스트랙 \";i:1;s:4:\"1tsp\";}i:5;a:2:{i:0;s:9:\"박력분\";i:1;s:4:\"100g\";}i:6;a:2:{i:0;s:15:\"아몬드가루\";i:1;s:3:\"10g\";}i:7;a:2:{i:0;s:18:\"베이킹파우더\";i:1;s:2:\"4g\";}i:8;a:2:{i:0;s:6:\"우유\";i:1;s:3:\"30g\";}i:9;a:2:{i:0;s:9:\"오레오\";i:1;s:4:\"6개\";}}', 'a:10:{i:0;a:2:{i:0;s:9:\"오레오\";i:1;s:4:\"6개\";}i:1;a:2:{i:0;N;i:1;N;}i:2;a:2:{i:0;N;i:1;N;}i:3;a:2:{i:0;N;i:1;N;}i:4;a:2:{i:0;N;i:1;N;}i:5;a:2:{i:0;N;i:1;N;}i:6;a:2:{i:0;N;i:1;N;}i:7;a:2:{i:0;N;i:1;N;}i:8;a:2:{i:0;N;i:1;N;}i:9;a:2:{i:0;N;i:1;N;}}'),
(9, 'a:10:{i:0;a:2:{i:0;s:14:\"순두부 1봉\";i:1;s:4:\"350g\";}i:1;a:2:{i:0;s:14:\"바지락 1봉\";i:1;s:4:\"200g\";}i:2;a:2:{i:0;s:6:\"계란\";i:1;s:4:\"1개\";}i:3;a:2:{i:0;N;i:1;N;}i:4;a:2:{i:0;N;i:1;N;}i:5;a:2:{i:0;N;i:1;N;}i:6;a:2:{i:0;N;i:1;N;}i:7;a:2:{i:0;N;i:1;N;}i:8;a:2:{i:0;N;i:1;N;}i:9;a:2:{i:0;N;i:1;N;}}', 'a:10:{i:0;a:2:{i:0;s:6:\"액젓\";i:1;s:7:\"1스푼\";}i:1;a:2:{i:0;s:6:\"대파\";i:1;s:13:\"1/2대 이상\";}i:2;a:2:{i:0;s:14:\"다진 마늘 \";i:1;s:9:\"1/2스푼\";}i:3;a:2:{i:0;s:13:\"고춧가루 \";i:1;s:10:\"1/2 스푼\";}i:4;a:2:{i:0;s:9:\"식용유\";i:1;s:10:\"3/2 스푼\";}i:5;a:2:{i:0;N;i:1;N;}i:6;a:2:{i:0;N;i:1;N;}i:7;a:2:{i:0;N;i:1;N;}i:8;a:2:{i:0;N;i:1;N;}i:9;a:2:{i:0;N;i:1;N;}}'),
(10, 'a:10:{i:0;a:2:{i:0;s:22:\"돼지고기 보쌈용\";i:1;s:4:\"600g\";}i:1;a:2:{i:0;s:12:\"씻은김치\";i:1;s:4:\"4장\";}i:2;a:2:{i:0;N;i:1;N;}i:3;a:2:{i:0;N;i:1;N;}i:4;a:2:{i:0;N;i:1;N;}i:5;a:2:{i:0;N;i:1;N;}i:6;a:2:{i:0;N;i:1;N;}i:7;a:2:{i:0;N;i:1;N;}i:8;a:2:{i:0;N;i:1;N;}i:9;a:2:{i:0;N;i:1;N;}}', 'a:10:{i:0;a:2:{i:0;s:9:\"참기름\";i:1;s:3:\"1/2\";}i:1;a:2:{i:0;N;i:1;N;}i:2;a:2:{i:0;s:6:\"간장\";i:1;s:1:\"1\";}i:3;a:2:{i:0;s:6:\"설탕\";i:1;s:3:\"1/2\";}i:4;a:2:{i:0;s:12:\"올리브유\";i:1;s:1:\"2\";}i:5;a:2:{i:0;s:6:\"마늘\";i:1;s:1:\"4\";}i:6;a:2:{i:0;s:6:\"생강\";i:1;s:1:\"1\";}i:7;a:2:{i:0;s:6:\"커피\";i:1;s:1:\"1\";}i:8;a:2:{i:0;s:10:\"통후추 \";i:1;s:5:\"10알\";}i:9;a:2:{i:0;s:6:\"된장\";i:1;s:1:\"2\";}}'),
(11, 'a:10:{i:0;a:2:{i:0;s:6:\"사과\";i:1;s:6:\"1/2개\";}i:1;a:2:{i:0;s:6:\"달걀\";i:1;s:4:\"2개\";}i:2;a:2:{i:0;s:12:\"올리브유\";i:1;s:9:\"적당량\";}i:3;a:2:{i:0;N;i:1;N;}i:4;a:2:{i:0;N;i:1;N;}i:5;a:2:{i:0;N;i:1;N;}i:6;a:2:{i:0;N;i:1;N;}i:7;a:2:{i:0;N;i:1;N;}i:8;a:2:{i:0;N;i:1;N;}i:9;a:2:{i:0;N;i:1;N;}}', 'a:10:{i:0;a:2:{i:0;s:19:\"핫케이크가루 \";i:1;s:10:\"3종이컵\";}i:1;a:2:{i:0;s:6:\"우유\";i:1;s:4:\"1컵\";}i:2;a:2:{i:0;N;i:1;N;}i:3;a:2:{i:0;N;i:1;N;}i:4;a:2:{i:0;N;i:1;N;}i:5;a:2:{i:0;N;i:1;N;}i:6;a:2:{i:0;N;i:1;N;}i:7;a:2:{i:0;N;i:1;N;}i:8;a:2:{i:0;N;i:1;N;}i:9;a:2:{i:0;N;i:1;N;}}'),
(12, 'a:10:{i:0;a:2:{i:0;s:6:\"감자\";i:1;s:4:\"2개\";}i:1;a:2:{i:0;s:19:\"모짜렐라 치즈\";i:1;s:7:\"1주먹\";}i:2;a:2:{i:0;s:6:\"후추\";i:1;s:7:\"1꼬집\";}i:3;a:2:{i:0;N;i:1;N;}i:4;a:2:{i:0;N;i:1;N;}i:5;a:2:{i:0;N;i:1;N;}i:6;a:2:{i:0;N;i:1;N;}i:7;a:2:{i:0;N;i:1;N;}i:8;a:2:{i:0;N;i:1;N;}i:9;a:2:{i:0;N;i:1;N;}}', 'a:10:{i:0;a:2:{i:0;s:6:\"우유\";i:1;s:2:\"2T\";}i:1;a:2:{i:0;s:9:\"베이컨\";i:1;s:4:\"4줄\";}i:2;a:2:{i:0;N;i:1;N;}i:3;a:2:{i:0;N;i:1;N;}i:4;a:2:{i:0;N;i:1;N;}i:5;a:2:{i:0;N;i:1;N;}i:6;a:2:{i:0;N;i:1;N;}i:7;a:2:{i:0;N;i:1;N;}i:8;a:2:{i:0;N;i:1;N;}i:9;a:2:{i:0;N;i:1;N;}}'),
(14, 'a:10:{i:0;a:2:{i:0;s:22:\"양배추 중간크기\";i:1;s:6:\"1/8쪽\";}i:1;a:2:{i:0;s:12:\"해물믹스\";i:1;s:4:\"2줌\";}i:2;a:2:{i:0;s:9:\"베이컨\";i:1;s:4:\"7줄\";}i:3;a:2:{i:0;s:6:\"계란\";i:1;s:4:\"3개\";}i:4;a:2:{i:0;s:12:\"튀김가루\";i:1;s:4:\"1컵\";}i:5;a:2:{i:0;s:15:\"가쓰오부시\";i:1;s:4:\"2줌\";}i:6;a:2:{i:0;N;i:1;N;}i:7;a:2:{i:0;N;i:1;N;}i:8;a:2:{i:0;N;i:1;N;}i:9;a:2:{i:0;N;i:1;N;}}', 'a:10:{i:0;a:2:{i:0;s:15:\"돈까스소스\";i:1;s:9:\"적당량\";}i:1;a:2:{i:0;s:12:\"마요네즈\";i:1;s:9:\"적당량\";}i:2;a:2:{i:0;s:9:\"식용유\";i:1;s:9:\"적당량\";}i:3;a:2:{i:0;N;i:1;N;}i:4;a:2:{i:0;N;i:1;N;}i:5;a:2:{i:0;N;i:1;N;}i:6;a:2:{i:0;N;i:1;N;}i:7;a:2:{i:0;N;i:1;N;}i:8;a:2:{i:0;N;i:1;N;}i:9;a:2:{i:0;N;i:1;N;}}'),
(15, 'a:10:{i:0;a:2:{i:0;s:6:\"부추\";i:1;s:4:\"100g\";}i:1;a:2:{i:0;s:6:\"새우\";i:1;s:11:\"15~20마리\";}i:2;a:2:{i:0;s:6:\"양파\";i:1;s:3:\"1/4\";}i:3;a:2:{i:0;N;i:1;N;}i:4;a:2:{i:0;N;i:1;N;}i:5;a:2:{i:0;N;i:1;N;}i:6;a:2:{i:0;N;i:1;N;}i:7;a:2:{i:0;N;i:1;N;}i:8;a:2:{i:0;N;i:1;N;}i:9;a:2:{i:0;N;i:1;N;}}', 'a:10:{i:0;a:2:{i:0;s:12:\"후춧가루\";i:1;s:6:\"약간\";}i:1;a:2:{i:0;s:6:\"액젓\";i:1;s:3:\"0.5\";}i:2;a:2:{i:0;s:9:\"얼음물\";i:1;s:4:\"1컵\";}i:3;a:2:{i:0;s:12:\"부침가루\";i:1;s:4:\"1컵\";}i:4;a:2:{i:0;N;i:1;N;}i:5;a:2:{i:0;N;i:1;N;}i:6;a:2:{i:0;N;i:1;N;}i:7;a:2:{i:0;N;i:1;N;}i:8;a:2:{i:0;N;i:1;N;}i:9;a:2:{i:0;N;i:1;N;}}'),
(16, 'a:10:{i:0;a:2:{i:0;s:6:\"달걀\";i:1;s:4:\"6개\";}i:1;a:2:{i:0;s:3:\"물\";i:1;s:6:\"1/3컵\";}i:2;a:2:{i:0;s:6:\"대파\";i:1;s:4:\"2쪽\";}i:3;a:2:{i:0;s:6:\"통깨\";i:1;s:6:\"약간\";}i:4;a:2:{i:0;N;i:1;N;}i:5;a:2:{i:0;N;i:1;N;}i:6;a:2:{i:0;N;i:1;N;}i:7;a:2:{i:0;N;i:1;N;}i:8;a:2:{i:0;N;i:1;N;}i:9;a:2:{i:0;N;i:1;N;}}', 'a:10:{i:0;a:2:{i:0;s:9:\"참기름\";i:1;s:6:\"약간\";}i:1;a:2:{i:0;s:6:\"설탕\";i:1;s:9:\"1/2큰술\";}i:2;a:2:{i:0;s:6:\"소금\";i:1;s:9:\"1/2스푼\";}i:3;a:2:{i:0;N;i:1;N;}i:4;a:2:{i:0;N;i:1;N;}i:5;a:2:{i:0;N;i:1;N;}i:6;a:2:{i:0;N;i:1;N;}i:7;a:2:{i:0;N;i:1;N;}i:8;a:2:{i:0;N;i:1;N;}i:9;a:2:{i:0;N;i:1;N;}}'),
(17, 'a:10:{i:0;a:2:{i:0;s:18:\"다진돼지고기\";i:1;s:4:\"200g\";}i:1;a:2:{i:0;s:6:\"양파\";i:1;s:6:\"1/2개\";}i:2;a:2:{i:0;s:9:\"양배추\";i:1;s:4:\"6매\";}i:3;a:2:{i:0;s:6:\"계란\";i:1;s:4:\"1개\";}i:4;a:2:{i:0;s:9:\"빵가루\";i:1;s:6:\"1/2컵\";}i:5;a:2:{i:0;s:6:\"우유\";i:1;s:2:\"2T\";}i:6;a:2:{i:0;N;i:1;N;}i:7;a:2:{i:0;N;i:1;N;}i:8;a:2:{i:0;N;i:1;N;}i:9;a:2:{i:0;N;i:1;N;}}', 'a:10:{i:0;a:2:{i:0;s:6:\"후추\";i:1;s:6:\"약간\";}i:1;a:2:{i:0;s:6:\"소금\";i:1;s:6:\"약간\";}i:2;a:2:{i:0;s:21:\"시판돈까스소스\";i:1;s:9:\"적당량\";}i:3;a:2:{i:0;N;i:1;N;}i:4;a:2:{i:0;N;i:1;N;}i:5;a:2:{i:0;N;i:1;N;}i:6;a:2:{i:0;N;i:1;N;}i:7;a:2:{i:0;N;i:1;N;}i:8;a:2:{i:0;N;i:1;N;}i:9;a:2:{i:0;N;i:1;N;}}'),
(18, 'a:10:{i:0;a:2:{i:0;s:7:\"식빵 \";i:1;s:4:\"4개\";}i:1;a:2:{i:0;s:6:\"달걀\";i:1;s:4:\"2개\";}i:2;a:2:{i:0;s:9:\"식용유\";i:1;s:6:\"약간\";}i:3;a:2:{i:0;N;i:1;N;}i:4;a:2:{i:0;N;i:1;N;}i:5;a:2:{i:0;N;i:1;N;}i:6;a:2:{i:0;N;i:1;N;}i:7;a:2:{i:0;N;i:1;N;}i:8;a:2:{i:0;N;i:1;N;}i:9;a:2:{i:0;N;i:1;N;}}', 'a:10:{i:0;a:2:{i:0;s:9:\"빵가루\";i:1;s:4:\"1컵\";}i:1;a:2:{i:0;s:19:\"프랑크 소시지\";i:1;s:4:\"4개\";}i:2;a:2:{i:0;N;i:1;N;}i:3;a:2:{i:0;N;i:1;N;}i:4;a:2:{i:0;N;i:1;N;}i:5;a:2:{i:0;N;i:1;N;}i:6;a:2:{i:0;N;i:1;N;}i:7;a:2:{i:0;N;i:1;N;}i:8;a:2:{i:0;N;i:1;N;}i:9;a:2:{i:0;N;i:1;N;}}'),
(19, 'a:10:{i:0;a:2:{i:0;s:18:\"돼지고기등심\";i:1;s:1:\" \";}i:1;a:2:{i:0;s:6:\"사과\";i:1;s:1:\" \";}i:2;a:2:{i:0;s:9:\"양배추\";i:1;s:1:\" \";}i:3;a:2:{i:0;s:6:\"대파\";i:1;s:1:\" \";}i:4;a:2:{i:0;s:12:\"전분가루\";i:1;s:1:\" \";}i:5;a:2:{i:0;s:6:\"맛술\";i:1;s:1:\" \";}i:6;a:2:{i:0;s:12:\"다진마늘\";i:1;s:1:\" \";}i:7;a:2:{i:0;s:12:\"다진생강\";i:1;s:1:\" \";}i:8;a:2:{i:0;s:6:\"소금\";i:1;s:1:\" \";}i:9;a:2:{i:0;s:6:\"후추\";i:1;s:1:\" \";}}', 'a:10:{i:0;a:2:{i:0;s:12:\"전분가루\";i:1;s:1:\" \";}i:1;a:2:{i:0;s:12:\"다진생강\";i:1;s:1:\" \";}i:2;a:2:{i:0;s:13:\"다진마늘 \";i:1;s:1:\" \";}i:3;a:2:{i:0;s:6:\"설탕\";i:1;s:1:\" \";}i:4;a:2:{i:0;s:6:\"간장\";i:1;s:1:\" \";}i:5;a:2:{i:0;s:3:\"물\";i:1;s:1:\" \";}i:6;a:2:{i:0;N;i:1;N;}i:7;a:2:{i:0;N;i:1;N;}i:8;a:2:{i:0;N;i:1;N;}i:9;a:2:{i:0;N;i:1;N;}}'),
(20, 'a:10:{i:0;a:2:{i:0;s:26:\"오리 훈제 슬라이스\";i:1;s:4:\"100g\";}i:1;a:2:{i:0;s:13:\"노랑 피망\";i:1;s:4:\"1개\";}i:2;a:2:{i:0;s:6:\"당근\";i:1;s:6:\"1/2개\";}i:3;a:2:{i:0;s:18:\"머스타드소스\";i:1;s:6:\"약간\";}i:4;a:2:{i:0;s:6:\"오이\";i:1;s:4:\"1개\";}i:5;a:2:{i:0;s:12:\"붉은피망\";i:1;s:4:\"1개\";}i:6;a:2:{i:0;s:12:\"적양배추\";i:1;s:4:\"2장\";}i:7;a:2:{i:0;N;i:1;N;}i:8;a:2:{i:0;N;i:1;N;}i:9;a:2:{i:0;N;i:1;N;}}', 'a:10:{i:0;a:2:{i:0;s:6:\"소금\";i:1;s:6:\"약간\";}i:1;a:2:{i:0;N;i:1;N;}i:2;a:2:{i:0;N;i:1;N;}i:3;a:2:{i:0;N;i:1;N;}i:4;a:2:{i:0;N;i:1;N;}i:5;a:2:{i:0;N;i:1;N;}i:6;a:2:{i:0;N;i:1;N;}i:7;a:2:{i:0;N;i:1;N;}i:8;a:2:{i:0;N;i:1;N;}i:9;a:2:{i:0;N;i:1;N;}}');

-- --------------------------------------------------------

--
-- 테이블 구조 `likes`
--

DROP TABLE IF EXISTS `likes`;
CREATE TABLE `likes` (
  `id` varchar(15) NOT NULL,
  `likedPosts` varchar(6) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- 테이블의 덤프 데이터 `likes`
--

INSERT INTO `likes` (`id`, `likedPosts`) VALUES
('admin', '1'),
('user9', '20');

-- --------------------------------------------------------

--
-- 테이블 구조 `member`
--

DROP TABLE IF EXISTS `member`;
CREATE TABLE `member` (
  `id` varchar(15) NOT NULL,
  `pwd` varchar(15) NOT NULL,
  `name` varchar(10) NOT NULL,
  `gender` tinyint(1) NOT NULL,
  `pdate` date NOT NULL,
  `profile_img` varchar(30) DEFAULT 'profile_img/default.jpg'
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- 테이블의 덤프 데이터 `member`
--

INSERT INTO `member` (`id`, `pwd`, `name`, `gender`, `pdate`, `profile_img`) VALUES
('admin', 'admin', '관리자', 1, '2023-05-16', 'profile_img/admin.png'),
('user1', '123', '유저1', 1, '2023-05-21', 'profile_img/default.jpg'),
('user10', '123', '유저10', 0, '2023-05-21', 'profile_img/default.jpg'),
('user2', '123', '유저2', 0, '2023-05-21', 'profile_img/default.jpg'),
('user3', '123', '유저3', 1, '2023-05-21', 'profile_img/default.jpg'),
('user4', '123', '유저4', 1, '2023-05-21', 'profile_img/default.jpg'),
('user5', '123', '유저5', 0, '2023-05-21', 'profile_img/default.jpg'),
('user6', '123', '유저6', 0, '2023-05-21', 'profile_img/default.jpg'),
('user7', '123', '유저7', 1, '2023-05-21', 'profile_img/default.jpg'),
('user8', '123', '유저8', 1, '2023-05-21', 'profile_img/default.jpg'),
('user9', '123', '유저9', 1, '2023-05-21', 'profile_img/default.jpg');

-- --------------------------------------------------------

--
-- 테이블 구조 `post`
--

DROP TABLE IF EXISTS `post`;
CREATE TABLE `post` (
  `recipe_No` int(5) NOT NULL,
  `title` varchar(40) NOT NULL,
  `recipe_name` varchar(15) NOT NULL,
  `posted_ID` varchar(15) NOT NULL,
  `posted_name` varchar(10) NOT NULL,
  `posted_date` date NOT NULL,
  `likes` int(11) NOT NULL DEFAULT 0,
  `cg_type` int(11) NOT NULL,
  `cg_material` int(11) NOT NULL,
  `cg_method` int(11) NOT NULL,
  `serving` int(11) NOT NULL,
  `cook_time` int(11) NOT NULL,
  `image` varchar(20) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- 테이블의 덤프 데이터 `post`
--

INSERT INTO `post` (`recipe_No`, `title`, `recipe_name`, `posted_ID`, `posted_name`, `posted_date`, `likes`, `cg_type`, `cg_material`, `cg_method`, `serving`, `cook_time`, `image`) VALUES
(1, '백종원 김치찌개 레시피 백종원 7분김치찌개', '김치찌개', 'admin', '관리자', '2023-06-01', 13, 3, 11, 22, 32, 46, 'thumbnail/1.jpeg'),
(2, '촉촉하고 진한 가나슈 초코 케이크', '시폰케이크', 'admin', '관리자', '2023-06-06', 0, 4, 14, 24, 36, 46, 'thumbnail/2.jpeg'),
(3, '공심채볶음만들기#모닝글로리볶음 만들기 ', '공심채볶음', 'admin', '관리자', '2023-06-06', 0, 1, 12, 21, 34, 45, 'thumbnail/3.jpeg'),
(4, '맛있는 떡갈비~갈비뼈대신 새송이버섯으로~', '떡갈비', 'admin', '관리자', '2023-06-06', 0, 1, 11, 24, 34, 46, 'thumbnail/4.jpeg'),
(5, '전기 보온밥솥 하나로 식혜 만들기', '식혜', 'admin', '관리자', '2023-06-06', 0, 7, 15, 22, 36, 46, 'thumbnail/5.jpeg'),
(6, '페루산 성게알 요리 파스타 레시피', '성게알 파스타', 'user1', '유저1', '2023-06-08', 0, 5, 13, 21, 33, 43, 'thumbnail/6.jpeg'),
(7, '오디복분자즙 냉국', '오디복분자즙 냉국', 'user2', '유저2', '2023-06-08', 0, 2, 16, 22, 32, 43, 'thumbnail/7.jpeg'),
(8, '오레오 크림치즈 머핀 만들기', '오레오 크림치즈 머핀', 'user3', '유저3', '2023-06-08', 0, 6, 15, 24, 36, 46, 'thumbnail/8.jpeg'),
(9, '보글보글 바지락 순두부', '바지락 순두부', 'user4', '유저4', '2023-06-08', 0, 3, 13, 22, 32, 43, 'thumbnail/9.jpeg'),
(10, '마늘보쌈-손님초대요리음식', '마늘 보쌈', 'user4', '유저4', '2023-06-08', 0, 1, 11, 28, 32, 45, 'thumbnail/10.jpeg'),
(11, '노오븐 사과케이크', '사과케이크', 'user4', '유저4', '2023-06-08', 0, 6, 16, 26, 34, 46, 'thumbnail/11.jpeg'),
(12, '재료도 방법도 초간단! 떠먹는 치즈감자', '치즈감자', 'user5', '유저5', '2023-06-08', 0, 4, 12, 26, 32, 44, 'thumbnail/12.jpeg'),
(14, '비 오는날 내맘대로 오코노미야끼~~', '오코노미야끼', 'user6', '유저6', '2023-06-08', 0, 4, 13, 23, 33, 46, 'thumbnail/14.jpeg'),
(15, '새우 부추전 바삭하게', '새우부추전', 'user6', '유저6', '2023-06-08', 0, 1, 12, 23, 32, 44, 'thumbnail/15.jpeg'),
(16, '백선생 폭탄달걀찜', '달걀찜', 'user7', '유저7', '2023-06-08', 0, 1, 14, 26, 32, 43, 'thumbnail/16.jpeg'),
(17, '멘치까스 만들기', '멘치까스', 'user8', '유저8', '2023-06-08', 0, 1, 11, 27, 32, 45, 'thumbnail/17.jpeg'),
(18, '하나만 먹어도 든든~식빵 핫도그', '식빵 핫도그', 'user9', '유저9', '2023-06-08', 0, 4, 15, 27, 34, 45, 'thumbnail/18.jpeg'),
(19, '돈등심 강정', '돼지고기 강정', 'user9', '유저9', '2023-06-08', 0, 1, 11, 27, 33, 47, 'thumbnail/19.jpeg'),
(20, '알록달록 색 고은 오리 훈제 채소쌈', '오리 훈제', 'user9', '유저9', '2023-06-08', 1, 1, 11, 25, 32, 45, 'thumbnail/20.jpeg');

-- --------------------------------------------------------

--
-- 테이블 구조 `steps`
--

DROP TABLE IF EXISTS `steps`;
CREATE TABLE `steps` (
  `recipe_No` int(5) NOT NULL,
  `info` varchar(3000) NOT NULL,
  `step_images` varchar(1000) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- 테이블의 덤프 데이터 `steps`
--

INSERT INTO `steps` (`recipe_No`, `info`, `step_images`) VALUES
(1, 'a:10:{i:0;s:298:\"쌀뜨물을 이용해서 김치찌개를 만들거예요^^\r\n쌀뜨물은 첫번째 물이 아닌 2번째난 3번째를 사용하셔야 좋아요^^\r\n쌀뜨물을 이용하면 쌀의 전분기가 재료들을 어우러지게 해서 감칠맛이 난다고 합니다.\r\n파는1/2를 준비해주세요.\";i:1;s:220:\"돼지고기 목살을 한줌을 준비해 주신다음 먹기 좋은 크기로 잘라주세요\r\n김치는 3줌을 준비합니다.\r\n파는 송송 썰어주세요\r\n고기와 김치의 비율은 1:3의 비율이랍니다.\";i:2;s:82:\"김치찌개를 끓일 냄비에 쌀뜨물700ml(종이컵5컵)을 넣어주세요.\";i:3;s:183:\"돼지고기목살(or삼겹살)을 한줌 넣어주세요.\r\n백종원님표 레시에서는 돼지기름이 포인트라서 물과 고기를 함께 끓여주는게 포인트랍니다.\";i:4;s:233:\"된장찌개를 1/2스푼 넣어줍니다.\r\n된장을 넣어주면 돼지고기의 잡냄새 제거와 깊은맛을 내준다고 한답니다.\r\n(돼지고기를 끓이면서 올라오는 불순물과 거품은 모두 건져주세요)\";i:5;s:175:\"김치찌개의 제일 중요포인트 김치를 넣어주세요\r\n아무리 좋은재료들이라도, 김치자체가 맛없으면 김치찌개의 맛을 좌지우지 하죠^^\";i:6;s:89:\"김치를 넣고 끓어 오르기 시작하면 다진마늘 한스푼을 넣어줍니다.\";i:7;s:390:\"그리고 고추가루를 한스푼 넣어주세요\r\n백종원님은 고운고추가루 1/2스푼, 굵은고추가루 1/2 스푼을 넣었는데\r\n그냥 저는 집에 있는 고추가루 한스푼을 넣었습니다.\r\n마지막으로 새우젓으로 간을 해주세요\r\n백종원님은 한스푼을 넣으라고 했는데, 전 간을 보니 간간해서 반스푼만 넣어주었습니다.\";i:8;s:155:\"마지막으로 청양고추와 대파를 넣고 한소큼 끓이면 백종원표 김치찌개 완성!\r\n생각보다 만드는 법도 어렵지 않아요^^\";i:9;N;}', 'a:10:{i:0;s:6:\"1.jpeg\";i:1;s:6:\"2.jpeg\";i:2;s:6:\"3.jpeg\";i:3;s:6:\"4.jpeg\";i:4;s:6:\"5.jpeg\";i:5;s:6:\"6.jpeg\";i:6;s:6:\"7.jpeg\";i:7;s:6:\"8.jpeg\";i:8;s:6:\"9.jpeg\";i:9;N;}'),
(2, 'a:10:{i:0;s:123:\"아몬드 가루, 코코아 가루, 애로루트 파우더, 베이킹 파우더는 볼에 넣어 가볍게 섞어두세요.\";i:1;s:173:\"볼에 달걀을 넣어 풀어주고, 에리스리톨, 바닐라 익스트랙, 소금을 넣은 후 약불에서 중탕으로 섞으면서 온도를 40°로 올려주세요.\";i:2;s:136:\"휘핑기를 고속으로 1분 정도 작동시키다가 거품이 풍성해지면 중속으로 내려 1분 동안 작동시켜주세요\";i:3;s:207:\"전체적으로 색이 밝아지고 기포가 작아지면 저속으로 1분 동안 작동시켜주세요. 반죽을 떨어뜨렸을 때 자국이 사라지지 않는다면 적당한 거품이 된 거예요.\";i:4;s:68:\"반죽 위에 체망을 놓고 1번의 가루류를 걸러주세요.\";i:5;s:121:\"주걱을 반죽 속 깊숙이 넣어 가루를 털어내듯 떠올려주세요. 이 동작을 40회 정도 해주세요.\";i:6;s:162:\"9번의 반죽을 주걱을 대고 부으며 골고루 퍼뜨려주세요. J자를 그리듯 볼 중앙을 훑으면서 재빠르게 30회 정도 섞어주세요.\";i:7;s:216:\"기포를 없애기 위해 반죽을 높은 위치에서 부어주고 테스터기나 틀을 부딪쳐 수증기를 제거해주세요. 180° 에서 15분 예열한 오븐에 170°에서 40분 동안 구워주세요.\";i:8;s:79:\"뒤집어서 틀과 데프론 시트지를 제거하고 잠시 식혀두세요.\";i:9;s:184:\"제누아즈 윗면에 가나슈를 부어 좌우로 쓸어주면서 자연스럽게 모양을 내주세요. 옆면은 가나슈를 쓸어내리듯 전체적으로 펴 발라주세요.\";}', 'a:10:{i:0;s:6:\"1.jpeg\";i:1;s:6:\"2.jpeg\";i:2;s:6:\"3.jpeg\";i:3;s:6:\"4.jpeg\";i:4;s:6:\"5.jpeg\";i:5;s:6:\"6.jpeg\";i:6;s:6:\"7.jpeg\";i:7;s:6:\"8.jpeg\";i:8;s:6:\"9.jpeg\";i:9;s:7:\"10.jpeg\";}'),
(3, 'a:10:{i:0;s:26:\"공심채를 준비해요.\";i:1;s:95:\"공심채를 식초물에 담가 5~10분정도 담가 두었다가 깨끗이 씻어 주세요.	\";i:2;s:49:\"물기를 뺀후 4등분으로 잘라 주세요.	\";i:3;s:48:\"앙념을 용량에 맞게 준비 해주세요.	\";i:4;s:89:\"팬에 올리브요와 다진마늘,크러쉬드레드페퍼를 넣고 볶아 주세요.	\";i:5;s:55:\"액젓과 굴소스,설탕을 넜고 섞어 주세요.	\";i:6;s:44:\"줄기부분부터 넣고 볶아 주세요.	\";i:7;s:69:\"잎파리는 살짝볶아 주시면 공심채볶음 완성입니다.	\";i:8;N;i:9;N;}', 'a:10:{i:0;s:6:\"1.jpeg\";i:1;s:6:\"2.jpeg\";i:2;s:6:\"3.jpeg\";i:3;s:6:\"4.jpeg\";i:4;s:6:\"5.jpeg\";i:5;s:6:\"6.jpeg\";i:6;s:6:\"7.jpeg\";i:7;s:6:\"8.jpeg\";i:8;N;i:9;N;}'),
(4, 'a:10:{i:0;s:76:\"양파와 대파는 다져서, 새송이는 4등분해서 준비해주세요\";i:1;s:135:\"모든 재료, 양념장 재료를 넣고 손으로 잘 치대 반죽해주세요\r\n5분이상 채대줘야 찰진게 맛나답니다~^^\";i:2;s:86:\" 반죽한 고기를 새송이 버섯 주위에 손으로 눌러가며 붙여주세요\";i:3;s:164:\"달궈진 팬에 기름을 두르고 약한불에서 고기가 잘 익을때까지 구워주세요\r\n너무 센불에 하면 겉은 타버리고 속은 안익어요~\";i:4;s:109:\" 잘 구워진 떡갈비를 그릇에 담아 주시면 완성~!!!\r\n먹음직스런 떡갈비 완성입니다~\";i:5;N;i:6;N;i:7;N;i:8;N;i:9;N;}', 'a:10:{i:0;s:6:\"1.jpeg\";i:1;s:6:\"2.jpeg\";i:2;s:6:\"3.jpeg\";i:3;s:6:\"4.jpeg\";i:4;s:6:\"5.jpeg\";i:5;N;i:6;N;i:7;N;i:8;N;i:9;N;}'),
(5, 'a:10:{i:0;s:98:\"물 2리터 분량의 물에 엿기름이 든 주머니를 넣고 1시간 가량 불려 주세요.\";i:1;s:153:\"물에 불린 엿기름을 주무르면 뽀얀 엿기름 물이 나와요. 그 물을 약 30분 정도 가만히 두어 앙금을 가라앉혀 주세요.\";i:2;s:101:\"밥이 다 지어지면 가라앉은 앙금이 들어가지 않게 엿기름 물을 부어 주세요.\";i:3;s:129:\"엿기름 주머니에 물 1리터를 추가로 붓고 다시 한 번 주무른 후 그 물을 밥솥에 마저 부어 주세요.\";i:4;s:114:\"엿기름 물과 밥을 섞어주고, 밥솥 뚜껑을 닫은 후 약 4~5시간 정도 밥알을 삭혀 주세요.\";i:5;s:95:\"밥알이 5~10알 정도 떠오르면 밥알의 일부를 건져내 찬물에 헹궈 주세요.\";i:6;s:71:\"찬물에 헹군 밥알을 생수에 담가 냉장 보관해 주세요.\";i:7;s:147:\"설탕 1컵 반을 넣어 고루 섞은 후 전기 보온 밥솥의 뚜껑을 열어 놓은 채 취사 버튼을 눌러 그대로 끓여 주세요.\";i:8;s:83:\"끓기 시작하면 거품을 걷어내며 10분~20분 정도 더 끓여 주세요.\";i:9;s:122:\"식혜에 고명으로 대추와 잣을 올렸어요. 하얀 밥알이 동동~ 예쁜 식혜가 완성 되었습니다. ^^\";}', 'a:10:{i:0;s:6:\"1.jpeg\";i:1;s:6:\"2.jpeg\";i:2;s:6:\"3.jpeg\";i:3;s:6:\"4.jpeg\";i:4;s:6:\"5.jpeg\";i:5;s:6:\"6.jpeg\";i:6;s:6:\"7.jpeg\";i:7;s:6:\"8.jpeg\";i:8;s:6:\"9.jpeg\";i:9;s:7:\"10.jpeg\";}'),
(6, 'a:10:{i:0;s:237:\"급랭 된 성게는 4시간 정도 냉장해동해서 준비하였습니다. 저는 100g을 두 팩 사서 한팩은 반정도 생으로 신선한 맛에 먹었어요. 그래서 150g을 사용하였는데 취향것 쓰시면 됩니다.	\";i:1;s:123:\"통마늘은 깨끗이 씻어 편을 썰어줍니다. 풋마늘 잎이나 대파는 아주 얇게 슬라이스해주세요.\";i:2;s:69:\"면은 소금 1T를 넣은 끓는 물에 5분 정도 삶았습니다.\";i:3;s:185:\"올리브유를 두른 팬이 달궈지면 마늘과 페페론치노(베트남고추)를 부셔서 볶아줍니다. 맵싹하니 향긋한 향미가 올라오면 면을 넣어주세요.\";i:4;s:264:\"저는 엔초비가 떨어져서 3인분 기준 액젓1T로 간을 하였는데 엔쵸비가 있으신분들은 활용하시면 됩니다. 마늘과 고추를 볶던 팬에 면을 넣고 면수를 2국자 넣으며 잘 익혀주다 버터 30g을 넣었습니다.\r\n\";i:5;s:358:\"그리고 성게알 100g을 투하 ! 상대적으로 무른 애들을 익혀주고 테두리가 살아있는 싱싱한 애들은 생으로 위에 얹기로 했어요. 익혀진 감칠맛과 생생하니 녹진하니 짙은 향의 매력을 동시에 즐기려구요. 면수도 2국자 더 추가했습니다. 나눠가며 넣어서 총 4국자 넣었어요.	\";i:6;s:382:\"요렇게 일부러 알들을 으깨가며 소스에 고루 녹아들게 하였습니다. 살짝이 끓어올랐을 때 불을 끄고 여열로 섞어줍니다. 시간적 여유가 있으시다면 갈아서 준비하는 것도 더욱 진한 소스의 요리팁이라고 할 수 있겠지요. 저는 그래도 약간의 알맹이가 식감있게 씹히는 것이 땡기더라구요.	\";i:7;s:397:\"마무리로는 잘게 다져준 대파고명 혹은 저처럼 풋마늘대 초록부분을 섞어주심 됩니다. 플레이팅할 때 면 위에 데코처럼 얹어주셔도 되요. 오목한 파스타볼을 따끈하게 데워주고 1인분씩 먹음직스럽게 담았습니다. 위에 도톰한 생 우니를 몇점 살포시 얹어주고 풋마늘잎 썬것을 올려 완성하였습니다.	\";i:8;N;i:9;N;}', 'a:10:{i:0;s:6:\"1.jpeg\";i:1;s:6:\"2.jpeg\";i:2;s:6:\"3.jpeg\";i:3;s:6:\"4.jpeg\";i:4;s:6:\"5.jpeg\";i:5;s:6:\"6.jpeg\";i:6;s:6:\"7.jpeg\";i:7;s:6:\"8.jpeg\";i:8;N;i:9;N;}'),
(7, 'a:10:{i:0;s:276:\"오복즙만 있어도 되지만 냉국하면 또 오이가 빠지면 섭섭하잖아요.. 냉장고에서 오이와 참외를 꺼내봅니다.. . . 오이는 넣어주면 좋고..참외는 있음넣고 없음 패쑤~ 참외와 오이는 껍질채 채썰어 준비합니다..	\";i:1;s:98:\"오복즙에 생수넣고.. 간맞춰서 오이와 참외를 넣어먹음되니 차암 쉽져잉~	\";i:2;s:240:\"얼음까지 동동띄워먹으니 장마철이라 입맛까지 후덥지근하더니 오복냉국 한그릇먹어주니 정말 시원하고 좋네요.. 아삭하게 씹히는 오이도좋고..달콤하게 씹히는 참외맛도 좋구요.	\";i:3;N;i:4;N;i:5;N;i:6;N;i:7;N;i:8;N;i:9;N;}', 'a:10:{i:0;s:6:\"1.jpeg\";i:1;s:6:\"2.jpeg\";i:2;s:6:\"3.jpeg\";i:3;N;i:4;N;i:5;N;i:6;N;i:7;N;i:8;N;i:9;N;}'),
(8, 'a:10:{i:0;s:124:\"볼에 말랑한 버터와 크림치즈를 넣고 부드럽게 풀어준 다음 설탕을 넣고 충분히 섞어주세요.	\";i:1;s:59:\"푼 달걀을 조금씩 넣어가며 잘 섞어주세요.\r\n\";i:2;s:179:\"박력분과 아몬드가루, 베이킹파우더는 체에 내려서 넣고 우유와 바닐라익스트랙도 넣은 다음 가루가 약간만 보일 정도만 섞어주세요.	\";i:3;s:94:\"오레오를 지퍼백에 넣고 대충 부서주세요(너무 곱게 부수지 마세요.).\r\n\";i:4;s:48:\"부순 오레오를 넣고 잘 섞어주세요.	\";i:5;s:38:\"머핀 틀에 80%씩 채워주세요.	\";i:6;s:94:\"머핀 1개당 오레오 1개씩 손으로 부셔서 약간 꾹 눌러가며 올려주세요.	\";i:7;s:60:\"170℃로 예열한 오븐에 25~30분간 구워주세요.\r\n\";i:8;s:56:\"잘 구워진 머핀은 충분히 식힌 후 드세요~	\";i:9;N;}', 'a:10:{i:0;s:6:\"1.jpeg\";i:1;s:6:\"2.jpeg\";i:2;s:6:\"3.jpeg\";i:3;s:6:\"4.jpeg\";i:4;s:6:\"5.jpeg\";i:5;s:6:\"6.jpeg\";i:6;s:6:\"7.jpeg\";i:7;s:6:\"8.jpeg\";i:8;s:6:\"9.jpeg\";i:9;N;}'),
(9, 'a:10:{i:0;s:38:\"바지락 1봉 넣고 끓여주세요.\";i:1;s:76:\"7~8분 정도 끓이면 돼요. 뚝배기 데워지는 시간이 있어서~~\";i:2;s:77:\"끓는 동안 양념 준비하세요. 마늘과 대파를 준비해주세요.\";i:3;s:91:\"고춧가루 1/2스푼을 준비하고~\r\n간단한 방법으로 고추기름 낼 거예요.\";i:4;s:57:\"식용유 1+1/2스푼을 고춧가루에 넣어주세요.\";i:5;s:172:\"고춧가루와 식용유를 스푼으로 섞어주세요. 번거롭게 끓이지 않아도 된답니다.\r\n저 나름대로의 비법이랍니다.[간단고추기름내기]\";i:6;s:63:\"그럼 이렇게 간단한 고추기름도 완성되었어요.	\";i:7;s:108:\"액젓 or 새우젓 or 소금 중에 아무거나 넣으셔도 되거든요.\r\n저희는 액젓 넣었어요.\";i:8;s:59:\"준비해 놓은 고추기름과 대파를 넣어주세요.\";i:9;s:182:\"그리고 날 계란 1개 넣어 주시면 돼요.\r\n우~와 간편하고 맛있는 바지락 순두부찌개가 완성이요.\r\n먹기만 하면 돼요....\r\n10~15분 정도면 OK.....\";}', 'a:10:{i:0;s:6:\"1.jpeg\";i:1;s:6:\"2.jpeg\";i:2;s:6:\"3.jpeg\";i:3;s:6:\"4.jpeg\";i:4;s:6:\"5.jpeg\";i:5;s:6:\"6.jpeg\";i:6;s:6:\"7.jpeg\";i:7;s:6:\"8.jpeg\";i:8;s:6:\"9.jpeg\";i:9;s:7:\"10.jpeg\";}'),
(10, 'a:10:{i:0;s:159:\"고기600g를 흐르는물에 잘씻은뒤 삶는다.\r\n(된장2,통후추10알,월계수잎2장,생강1,불끄기 10분전 커피1)\r\n센불10분/중간불30분\";i:1;s:20:\"김치 씻어두기	\";i:2;s:159:\"마늘보쌈소스:올리브유2,마늘4,설탕1/2,간장1,식초1,약한불에 순서대로넣고 마지막에 올리고당2,참기름1/2넣고 1분조리기	\";i:3;s:58:\"새우젓1.물1/2넣고 씻은 야채들과 함께 먹기	\";i:4;N;i:5;N;i:6;N;i:7;N;i:8;N;i:9;N;}', 'a:10:{i:0;s:6:\"1.jpeg\";i:1;s:6:\"2.jpeg\";i:2;s:6:\"3.jpeg\";i:3;s:6:\"4.jpeg\";i:4;N;i:5;N;i:6;N;i:7;N;i:8;N;i:9;N;}'),
(11, 'a:10:{i:0;s:62:\"그릇에 우유1컵 달걀2개를 넣고 고루 섞어주고	\";i:1;s:35:\"핫케이크 가루 3컵을 넣고	\";i:2;s:49:\"핫케이크가루가 잘 풀리게 섞어주고	\";i:3;s:164:\"전기밥솥에 올리브유를 바르고 반죽해 놓은 핫케이크가루를 부어주고 사과를 듬성 듬성 잘라 넣어주세요. (사과는 취향껏)	\";i:4;s:42:\"예쁘라고 ㅋㅋㅋㅋ 나름 데코??	\";i:5;s:60:\"만능찜 20분 취사 2번 (총 만든시간 40분 소요)	\";i:6;s:102:\"완성된 사과케이크를 쟁반이나 접시에 뒤집어 주면 똑~ 하고 잘 떨어집니다.	\";i:7;s:126:\"사과케이크 완성 만드는법 쉽죠. 그냥 먹어도 좋고요...혹시 생크림 또는 시럽 곁들여도 좋을듯\";i:8;N;i:9;N;}', 'a:10:{i:0;s:6:\"1.jpeg\";i:1;s:6:\"2.jpeg\";i:2;s:6:\"3.jpeg\";i:3;s:6:\"4.jpeg\";i:4;s:6:\"5.jpeg\";i:5;s:6:\"6.jpeg\";i:6;s:6:\"7.jpeg\";i:7;s:6:\"8.jpeg\";i:8;N;i:9;N;}'),
(12, 'a:10:{i:0;s:119:\"제일 먼저 물에 감자를 넣고 삶아줄게요\r\n감자 따로 먹으려고 같이 삶아서 4개랍니당ㅎㅎ	\";i:1;s:61:\"잘라놓은 베이컨을 노릇노릇하게 익혀주세요	\";i:2;s:50:\"감자가 다 익으면 접시에 으깨주세요	\";i:3;s:60:\"으깨진 감자 위로 베이컨을 솔솔 뿌려줄게요	\";i:4;s:26:\"치즈를 뿌려주세요	\";i:5;s:47:\"우유 2스푼을 살짝코롬 넣어줄게요	\";i:6;s:33:\"후추도 톡톡 뿌려주세요	\";i:7;s:29:\"그다음 믹스해줄게요	\";i:8;s:67:\"믹스하고 난 후 치즈를 취향껏 드음뿍 넣어주세요	\";i:9;s:104:\"전자렌지 혹은 오븐에 3분정도만 구워줄게요\r\n파슬리 톡톡 뿌리면 완성입니당!\";}', 'a:10:{i:0;s:6:\"1.jpeg\";i:1;s:6:\"2.jpeg\";i:2;s:6:\"3.jpeg\";i:3;s:6:\"4.jpeg\";i:4;s:6:\"5.jpeg\";i:5;s:6:\"6.jpeg\";i:6;s:6:\"7.jpeg\";i:7;s:6:\"8.jpeg\";i:8;s:6:\"9.jpeg\";i:9;s:7:\"10.jpeg\";}'),
(14, 'a:10:{i:0;s:103:\"계란 풀고 튀김(부침)가루 넣어 반죽한 후 잘게 썬 양배추를 넣고 섞어주세요.\";i:1;s:91:\"양배추를 잘 버무려놓고 깨끗하게 씻은 해물을 넣어 잘 섞어줍니다.	\";i:2;s:177:\"팬에 식용유를 넉넉히 두르고 반죽을 두툼하게 올려준 후 잘게썬 베이컨두 올려줍니다. 약불에 부쳐야 타지않고 속까지 잘익습니다.	\";i:3;s:92:\"한쪽이 노릇하게 익으면 뒤집어서 다른한쪽두 노릇하게 익혀줍니다.	\";i:4;s:69:\"접시에 담고 마요네즈와 돈까스소스를 뿌려줍니다.	\";i:5;s:100:\"그 위에 가쓰오부시 한줌 올려주면 고소하고 부드러운 오코노미야끼 완성~	\";i:6;N;i:7;N;i:8;N;i:9;N;}', 'a:10:{i:0;s:6:\"1.jpeg\";i:1;s:6:\"2.jpeg\";i:2;s:6:\"3.jpeg\";i:3;s:6:\"4.jpeg\";i:4;s:6:\"5.jpeg\";i:5;s:6:\"6.jpeg\";i:6;N;i:7;N;i:8;N;i:9;N;}'),
(15, 'a:10:{i:0;s:331:\"부추는 다듬어 물에 씻어주고 4cm~5cm 길이로 썰어주고, 양파는 채 썰어줍니다.\r\n저는 새우가 작아서 그냥 사용했는데요. 혹시 크다면 2~3등분 해 주세요.\r\n부침개에 양파를 채 썰어 넣어주면 휠씬 맛있어요.\r\n그러니 양파는 꼬~옥 넣어주셔야 합니다. ㅋㅋ\";i:1;s:233:\"부침가루 1컵 그리고 얼음물 1컵을 붓고 고루 섞어주세요.\r\n이때 얼음물 또는 탄산수를 넣어주면\r\n부침개가 확실히 바삭하답니다.\r\n이 부분을 지켜 줘야 부추전이 바삭바삭해요.\";i:2;s:202:\"반죽에 준비한 재료인 부추, 양파, 새우를 넣고\r\n양념재료인 액젓 0.5, 후춧가루 약간을 넣어 고루 섞어 반죽해주세요.\r\n* 액젓 대신 국간장을 넣어도 돼요\";i:3;s:264:\"달군 팬에 기름을 조금 넉넉하게 두르고\r\n부침 반죽을 올려 넓게 펼쳐주고\r\n앞, 뒤로 노릇하게 부쳐 주세요.\r\n부침개는 두꺼우면 맛이 없으니\r\n최대한 얇게 펼쳐주세요. 그래야지 바삭하니 맛있답니다.\";i:4;N;i:5;N;i:6;N;i:7;N;i:8;N;i:9;N;}', 'a:10:{i:0;s:6:\"1.jpeg\";i:1;s:6:\"2.jpeg\";i:2;s:6:\"3.jpeg\";i:3;s:6:\"4.jpeg\";i:4;N;i:5;N;i:6;N;i:7;N;i:8;N;i:9;N;}'),
(16, 'a:10:{i:0;s:31:\"달걀 6개를 준비했어요.\";i:1;s:159:\"소금 1/2큰술,설탕 1/2큰술을 넣어주세요. 계란은 설탕과 잘 어울리기도 하고, 또 부풀게 하는데 중요한 역할을 한다네요.\";i:2;s:87:\"물은 1/3컵을 넣어주세요. 이보다 많이 넣어도 상관없다고 하네요.\";i:3;s:33:\"거품기로 잘 저어주세요.\";i:4;s:76:\"뚝배기에 계란물을 부어주세요. 80% 채워주시면 된답니다.\";i:5;s:29:\"중불에서 끓여주세요.\";i:6;s:131:\"엉기기 시작하면 갑작스럽게 익기 시작하니 골고루 슥슥 저어주세요. 달걀이 80~90% 정도 익었을 때,\";i:7;s:60:\"뚜껑을 덮어주세요. 그리고 약불로 줄이세요.\";i:8;s:272:\"이렇게 기다리다보면 신호가 온데요. 어떤 날은 치이 소리가 나면서 물이 뚝뚝 떨어지기도 하고요, 또 어떤 날은 살짝 탄내가 나기도 하고요. 3분 정도 기다리다 보니 바로 첫번째 신호가 오네요. 물이 뚝뚝.\";i:9;s:80:\"파고명도 올리고, 참기름도 살짝 뿌려서 고소함을 더해야죠.\";}', 'a:10:{i:0;s:6:\"1.jpeg\";i:1;s:6:\"2.jpeg\";i:2;s:6:\"3.jpeg\";i:3;s:6:\"4.jpeg\";i:4;s:6:\"5.jpeg\";i:5;s:6:\"6.jpeg\";i:6;s:6:\"7.jpeg\";i:7;s:6:\"8.jpeg\";i:8;s:6:\"9.jpeg\";i:9;s:7:\"10.jpeg\";}'),
(17, 'a:10:{i:0;s:319:\"하나씩 뜯은 양배추는 3매정도씩 돌돌 말아서 얇게 썰면 됩니다. 양배추를 반으로 잘라서 얇게 채썰 방법도 있지만그 방법은 절단면이 많아서 빨리 질이 떨어진다는 점이 단점이지요. 이렇게 채썬 양배추는 다시 한 번좀 더 작게 잘라주세요.	\";i:1;s:45:\"물로 씻은 후 소금으로 절입니다.	\";i:2;s:287:\"양파는 껍질을 까고 반으로 잘라주세요. 아랫쪽부터 윗쪽으로 3~4번정도 가로로 칼집을 내줍니다. 다음은 세로로 칼집을 내줍니다. 이 때도 끝부분은 남겨주세요. 마지막에 수직으로 칼질을 내주시면 다진양파 완성~	\r\n\";i:3;s:200:\"이렇게 다진 양파는 미리 예열한 팬에 식용유를 두르고 살짝 볶아서 식혀줍니다. 볶은 양파가 식으면 다진돼지고기를 넣고 소금, 후추로 간을 합니다.	\";i:4;s:239:\"미리 절인 양배추는 물기를 짜고 계란과 함께 고기, 양파와 잘 섞어주세요. 빵가루와 우유를 넣고 주물록 주물록 잘 섞어줍니다. 이 때 반죽의 수분을 보고 빵가루로 조절해주세요.	\";i:5;s:122:\"밀가루->푼 계란->빵가루 순서로 준비하고 후라이팬에 식용유를 적당하게 넣고 예열합니다.	\";i:6;s:83:\"동그랗게 모양을 만들어주고 순서대로 튀김 옷을 입혀줍니다.	\";i:7;s:317:\"빵가루를 조금만 떨어뜨려보고 바로 위로 올라오면 적당한 온도예요. 옷을 입힌 반죽을 튀겨줍니다.(전 팬이 커서 기름은 듬뿍 안넣고 튀겼어요) 속이 익도록 약불~중간불정도로 충분히 잘 튀겨주세요~ 거품이 작아지면 뒤집어주시면 완성!	\";i:8;N;i:9;N;}', 'a:10:{i:0;s:6:\"1.jpeg\";i:1;s:6:\"2.jpeg\";i:2;s:6:\"3.jpeg\";i:3;s:6:\"4.jpeg\";i:4;s:6:\"5.jpeg\";i:5;s:6:\"6.jpeg\";i:6;s:6:\"7.jpeg\";i:7;s:6:\"8.jpeg\";i:8;N;i:9;N;}'),
(18, 'a:10:{i:0;s:114:\"재료 준비합니다 프랑크 소시지는 전자레인지에 2분 정도 돌려 따뜻하게 해주었어요\r\n\";i:1;s:98:\"달걀 2개는 볼에 넣고 풀어주세요 빵가루는 넓은 그릇에 넣어 준비합니다	\";i:2;s:50:\"식빵 4장은 테두리를 잘라주었습니다	\";i:3;s:66:\"식빵을 밀대나 깨끗한 유리병으로 밀어 펴주세요	\";i:4;s:111:\"밀어 놓은 식빵의 안쪽에 달걀물을 조금 바른 후 소시지를 올려 단단히 말아주세요	\";i:5;s:61:\"말아 놓은 식빵 소시지를 달걀물에 푹 적시고	\";i:6;s:79:\"빵가루를 입혀주세요\r\n달걀물~빵가루 순서대로 묻히면 돼요\";i:7;s:43:\"빵가루 입혀 살짝씩 눌러줍니다	\";i:8;s:93:\"데워진 기름에 빵가루 묻힌 식빵 소시지를 넣고 굴려가며 튀겨주세요	\";i:9;s:144:\"노릇노릇하게 구운 후 키친타월 위에 올려 기름 제거합니다 한 개만 먹어도 든든한 식빵 핫도그 완성입니다	\";}', 'a:10:{i:0;s:6:\"1.jpeg\";i:1;s:6:\"2.jpeg\";i:2;s:6:\"3.jpeg\";i:3;s:6:\"4.jpeg\";i:4;s:6:\"5.jpeg\";i:5;s:6:\"6.jpeg\";i:6;s:6:\"7.jpeg\";i:7;s:6:\"8.jpeg\";i:8;s:6:\"9.jpeg\";i:9;s:7:\"10.jpeg\";}'),
(19, 'a:10:{i:0;s:76:\"돼지고기 등심은 길쭉하게 먹기 좋은 크기로 썰어줍니다.\";i:1;s:134:\"맛술 2스푼, 다진마늘 1/2스푼, 다진생강, 소금, 후추를 조금씩 넣고 밑간을 해둡니다. (밥숟가락 계량)\";i:2;s:83:\"골고루 섞어가며 조물조물 해준 다음 잠시 그대로 놓아둡니다.\";i:3;s:111:\"양배추와 사과, 대파는 가늘게 채썰어 준비합니다.(양배추는 잎부분만 사용합니다 )\";i:4;s:150:\"비닐백에 전분가루를 담아줍니다.\r\n그리고 밑간해 둔 등심을 넣고, 비닐백 입구를 잘 오므린다음, 흔들어 줍니다.\";i:5;s:105:\"팬에 기름을 넉넉히 넣고 가열한 다음, 전분가루 옷을 입은 등심을 튀겨줍니다.\";i:6;s:119:\"노릇하게 잘 익을 때까지 저어가면서 튀겨주신 후에 종이호일에 담아 기름기를 빼주세요.\";i:7;s:324:\"물 한컵(200ml), 간장 반컵(100ml), 설탕 2스푼, 다진마늘 1/2스푼, 다진생강을 조금 넣고 끓이다가, 전분 2스푼을 푼 물을 넣어 농도를 맞춰줍니다.\r\n너무 오래 끓이면 소스가 짜질 수 있으니, 한번 부글부글 끓고나면 전분물을 넣어 농도를 맞춰주세요.\";i:8;s:96:\"이렇게 만들어진 강정소스에 튀겨낸 등심을 넣고 다시 한번 볶아줍니다.\";i:9;s:155:\"채썰어둔 양배추와 사과, 대파를 잘 섞어서 접시에 듬뿍 담아준 다음 그 위에 등심강정을 올려주고 깨를 뿌려줍니다.\";}', 'a:10:{i:0;s:6:\"1.jpeg\";i:1;s:6:\"2.jpeg\";i:2;s:6:\"3.jpeg\";i:3;s:6:\"4.jpeg\";i:4;s:6:\"5.jpeg\";i:5;s:6:\"6.jpeg\";i:6;s:6:\"7.jpeg\";i:7;s:6:\"8.jpeg\";i:8;s:6:\"9.jpeg\";i:9;s:7:\"10.jpeg\";}'),
(20, 'a:10:{i:0;s:84:\"오이는 깨끗하게 씻어 돌려 깎기를 해서 곱게 채를 썰어둔다.	\r\n\";i:1;s:125:\"피망은 양쪽 가장자리를 잘라내고 양배추도 두터운 줄기는 져며 내야 곱게 채를 썰 수 있다.	\r\n\";i:2;s:64:\"피망도 속 재료는 파내고 곱게 채를 썰어준다.	\r\n\";i:3;s:25:\"곱게 채 썬 모습.	\r\n\";i:4;s:123:\"채 썰어둔 채소는 프라이팬에 살짝 볶아 수분을 날려주고 오리 슬라이스 훈제도 준비한다.	\r\n\";i:5;s:18:\"완성된 모습.	\";i:6;N;i:7;N;i:8;N;i:9;N;}', 'a:10:{i:0;s:6:\"1.jpeg\";i:1;s:6:\"2.jpeg\";i:2;s:6:\"3.jpeg\";i:3;s:6:\"4.jpeg\";i:4;s:6:\"5.jpeg\";i:5;s:6:\"6.jpeg\";i:6;N;i:7;N;i:8;N;i:9;N;}');

-- --------------------------------------------------------

--
-- 테이블 구조 `subusers`
--

DROP TABLE IF EXISTS `subusers`;
CREATE TABLE `subusers` (
  `id` varchar(15) NOT NULL,
  `subscribedUser` varchar(15) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- 테이블의 덤프 데이터 `subusers`
--

INSERT INTO `subusers` (`id`, `subscribedUser`) VALUES
('user9', 'admin');

--
-- 덤프된 테이블의 인덱스
--

--
-- 테이블의 인덱스 `ingredient`
--
ALTER TABLE `ingredient`
  ADD PRIMARY KEY (`recipe_No`);

--
-- 테이블의 인덱스 `likes`
--
ALTER TABLE `likes`
  ADD PRIMARY KEY (`id`,`likedPosts`);

--
-- 테이블의 인덱스 `member`
--
ALTER TABLE `member`
  ADD PRIMARY KEY (`id`);

--
-- 테이블의 인덱스 `post`
--
ALTER TABLE `post`
  ADD PRIMARY KEY (`recipe_No`),
  ADD KEY `posted_ID` (`posted_ID`);

--
-- 테이블의 인덱스 `steps`
--
ALTER TABLE `steps`
  ADD PRIMARY KEY (`recipe_No`);

--
-- 테이블의 인덱스 `subusers`
--
ALTER TABLE `subusers`
  ADD PRIMARY KEY (`id`,`subscribedUser`);

--
-- 덤프된 테이블의 AUTO_INCREMENT
--

--
-- 테이블의 AUTO_INCREMENT `post`
--
ALTER TABLE `post`
  MODIFY `recipe_No` int(5) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=21;

--
-- 덤프된 테이블의 제약사항
--

--
-- 테이블의 제약사항 `likes`
--
ALTER TABLE `likes`
  ADD CONSTRAINT `likes_ibfk_1` FOREIGN KEY (`id`) REFERENCES `member` (`id`) ON DELETE CASCADE;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
